Revit 2024 API
IndexStreamLine Methods
The IndexStreamLine type exposes the following members.
Methods
Name | Description
AddLine
 Inserts a IndexLine segment into the stream and associated buffer.
AddLines
 Inserts multiple IndexLine segments into the stream and associated buffer.
Dispose |  (Inherited from IndexStream.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
IndexStreamLine Class
Autodesk.Revit.DB.DirectContext3D Namespace